app/controllers/users_controller.rb

  def show
    @user = User.find(params[:id])
    @microposts = @user.microposts.paginate(page: params[:page])
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 2]]
SELECT  "users".* FROM "users"   ORDER BY "users"."id" ASC LIMIT 1

  def create
    @user = User.new(user_params)

    if @user.save == true
---
INSERT INTO "users" ("created_at", "email", "name", "password_digest", "updated_at") VALUES (?, ?, ?, ?, ?)

  def update
    @user = User.find(params[:id])

    if @user.update(user_params) == true
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "users" SET "name" = ?, "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = 1  [["name", "Nurbolat"], ["password_digest", "$2a$10$u9R3vbSG/cq/inDUhjscpuHybWO/JRMT61iu.Mn8kfuhb8Ux7/jB2"], ["updated_at", "2015-02-11 10:00:14.452991"]]